In [1]:
import pandas as pd
d = {"country" : ["China", "America", "Japan"],
     "population" : [14.22, 3.18, 1.29]
    }
df = pd.DataFrame(d)
df

   country  population
0    China       14.22
1  America        3.18
2    Japan        1.29

In [3]:
df = pd.DataFrame(d, index=['a', 'b', 'c'])
df

   country  population
a    China       14.22
b  America        3.18
c    Japan        1.29

In [4]:
d = {'one' : pd.Series(['a','b','c'], index=[1,2,3]),
     'two' : pd.Series(['a','b','c','d'], index=[1,2,3,4])
    }

df = pd.DataFrame(d)

df

   one two
1    a   a
2    b   b
3    c   c
4  NaN   d

In [5]:
import pandas as pd
df = pd.read_csv('Datasets/breast_cancer/breast_cancer.csv')
df

,id,diagnosis,radius_mean,texture_mean,perimeter_mean,area_mean,smoothness_mean,compactness_mean,concavity_mean,concave points_mean,...,texture_worst,perimeter_worst,area_worst,smoothness_worst,compactness_worst,concavity_worst,concave points_worst,symmetry_worst,fractal_dimension_worst,Unnamed: 32
0,842302,M,17.99,10.38,122.80,1001.0,0.11840,0.27760,0.30010,0.14710,...,17.33,184.60,2019.0,0.16220,0.66560,0.7119,0.2654,0.4601,0.11890,NaN
1,842517,M,20.57,17.77,132.90,1326.0,0.08474,0.07864,0.08690,0.07017,...,23.41,158.80,1956.0,0.12380,0.18660,0.2416,0.1860,0.2750,0.08902,NaN
2,84300903,M,19.69,21.25,130.00,1203.0,0.10960,0.15990,0.19740,0.12790,...,25.53,152.50,1709.0,0.14440,0.42450,0.4504,0.2430,0.3613,0.08758,NaN
3,84348301,M,11.42,20.38,77.58,386.1,0.14250,0.28390,0.24140,0.10520,...,26.50,98.87,567.7,0.20980,0.86630,0.6869,0.2575,0.6638,0.17300,NaN
4,84358402,M,20.29,14.34,135.10,1297.0,0.10030,0.13280,0.19800,0.10430,...,16.67,152.20,1575.0,0.13740,0.20500,0.4000,0.1625,0.2364,0.07678,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
564,926424,M,21.56,22.39,142.00,1479.0,0.11100,0.11590,0.24390,0.13890,...,26.40,166.10,2027.0,0.14100,0.21130,0.4107,0.2216,0.2060,0.07115,NaN
565,926682,M,20.13,28.25,131.20,1261.0,0.09780,0.10340,0.14400,0.09791,...,38.25,155.00,1731.0,0.11660,0.19220,0.3215,0.1628,0.2572,0.06637,NaN
566,926954,M,16.60,28.08,108.30,858.1,0.08455,0.10230,0.09251,0.05302,...,34.12,126.70,1124.0,0.11390,0.30940,0.3403,0.1418,0.2218,0.07820,NaN
567,927241,M,20.60,29.33,140.10,1265.0,0.11780,0.27700,0.35140,0.15200,...,39.42,184.60,1821.0,0.16500,0.86810,0.9387,0.2650,0.4087,0.12400,NaN
568,92751,B,7.76,24.54,47.92,181.0,0.05263,0.04362,0.00000,0.00000,...,30.37,59.16,268.6,0.08996,0.06444,0.0000,0.0000,0.2871,0.07039,NaN

In [9]:
# use column name to choose 3 attributes and return their values
df_part = df[['diagnosis', 'radius_mean', 'perimeter_mean']]
df_part

    diagnosis  radius_mean  perimeter_mean
0           M        17.99          122.80
1           M        20.57          132.90
2           M        19.69          130.00
3           M        11.42           77.58
4           M        20.29          135.10
..        ...          ...             ...
564         M        21.56          142.00
565         M        20.13          131.20
566         M        16.60          108.30
567         M        20.60          140.10
568         B         7.76           47.92

[569 rows x 3 columns]

In [10]:
# insert df_part data into breast_cancer.csv. If the file does exist, it will create one.
df_part.to_csv('Datasets/breast_cancer/breast_cancer.csv', index=False)
# read the file breast_cancer_part.csv
df_new = pd.read_csv('Datasets/breast_cancer/breast_cancer_part.csv')

df_new

    diagnosis  radius_mean  perimeter_mean
0           M        17.99          122.80
1           M        20.57          132.90
2           M        19.69          130.00
3           M        11.42           77.58
4           M        20.29          135.10
..        ...          ...             ...
564         M        21.56          142.00
565         M        20.13          131.20
566         M        16.60          108.30
567         M        20.60          140.10
568         B         7.76           47.92

[569 rows x 3 columns]

In [3]:
import pandas as pd
# use pandas to read JSON file, save it to DataFrame variable df
df = pd.read_json('Datasets/iris/iris.json')
df

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

In [4]:
df_part = df[:10]
df_part

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa
5          5.4         3.9          1.7         0.4  setosa
6          4.6         3.4          1.4         0.3  setosa
7          5.0         3.4          1.5         0.2  setosa
8          4.4         2.9          1.4         0.2  setosa
9          4.9         3.1          1.5         0.1  setosa

In [6]:
# write df_part data into iris_part.json file
df_part.to_json('Datasets/iris/iris_part.json')
# use Pandas to read JSON file and save it to df_new
df_new = pd.read_json('Datasets/iris/iris_part.json')
df_new

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa
5          5.4         3.9          1.7         0.4  setosa
6          4.6         3.4          1.4         0.3  setosa
7          5.0         3.4          1.5         0.2  setosa
8          4.4         2.9          1.4         0.2  setosa
9          4.9         3.1          1.5         0.1  setosa

In [3]:
import pandas as pd
df = pd.read_excel('Datasets/bitcoin/bitcoin.xlsx')
df

,Date,Open,High,Low,Close,Volume,Market Cap
0,"Feb 01, 2021",33114.58,34638.21,32384.23,33537.18,"61,400,400,660","624,349,044,409"
1,"Jan 31, 2021",34270.88,34288.33,32270.18,33114.36,"52,754,542,671","616,452,744,533"
2,"Jan 30, 2021",34295.94,34834.71,32940.19,34269.52,"65,141,828,798","637,924,573,284"
3,"Jan 29, 2021",34318.67,38406.26,32064.81,34316.39,"117,894,572,511","638,768,671,362"
4,"Jan 28, 2021",30441.04,31891.30,30023.21,31649.61,"78,948,162,368","589,083,045,078"
...,...,...,...,...,...,...,...
2831,"May 03, 2013",106.25,108.13,79.10,97.75,0,"1,085,995,169"
2832,"May 02, 2013",116.38,125.60,92.28,105.21,0,"1,168,517,495"
2833,"May 01, 2013",139.00,139.89,107.72,116.99,0,"1,298,954,594"
2834,"Apr 30, 2013",144.00,146.93,134.05,139.00,0,"1,542,813,125"
2835,"Apr 29, 2013",134.44,147.49,134.00,144.54,0,"1,603,768,865"

In [4]:
df_part = df[:10][df.columns[0:5]]
df_part

           Date      Open      High       Low     Close
0  Feb 01, 2021  33114.58  34638.21  32384.23  33537.18
1  Jan 31, 2021  34270.88  34288.33  32270.18  33114.36
2  Jan 30, 2021  34295.94  34834.71  32940.19  34269.52
3  Jan 29, 2021  34318.67  38406.26  32064.81  34316.39
4  Jan 28, 2021  30441.04  31891.30  30023.21  31649.61
5  Jan 27, 2021  32564.03  32564.03  29367.14  30432.55
6  Jan 26, 2021  32358.61  32794.55  31030.27  32569.85
7  Jan 25, 2021  32285.80  34802.74  32087.79  32366.39
8  Jan 24, 2021  32064.38  32944.01  31106.69  32289.38
9  Jan 23, 2021  32985.76  33360.98  31493.16  32067.64

In [6]:
df_part.to_excel('Datasets/bitcoin/bitcoin_part.xlsx', index=False)

In [7]:
df_new = pd.read_excel('Datasets/bitcoin/bitcoin_part.xlsx')

In [8]:
df_new

           Date      Open      High       Low     Close
0  Feb 01, 2021  33114.58  34638.21  32384.23  33537.18
1  Jan 31, 2021  34270.88  34288.33  32270.18  33114.36
2  Jan 30, 2021  34295.94  34834.71  32940.19  34269.52
3  Jan 29, 2021  34318.67  38406.26  32064.81  34316.39
4  Jan 28, 2021  30441.04  31891.30  30023.21  31649.61
5  Jan 27, 2021  32564.03  32564.03  29367.14  30432.55
6  Jan 26, 2021  32358.61  32794.55  31030.27  32569.85
7  Jan 25, 2021  32285.80  34802.74  32087.79  32366.39
8  Jan 24, 2021  32064.38  32944.01  31106.69  32289.38
9  Jan 23, 2021  32985.76  33360.98  31493.16  32067.64

In [11]:
import pandas as pd
d = {'country' : ['America', 'China', 'Japan'], 
     'population' : [14.22, 3.18, 1.29]
    }
df = pd.DataFrame(d)
df

   country  population
0  America       14.22
1    China        3.18
2    Japan        1.29

In [12]:
# add a row of data
df.loc[3] = {
                'country': 'Russia',
                'population' : 1.4
            }
df

   country  population
0  America       14.22
1    China        3.18
2    Japan        1.29
3   Russia        1.40

In [14]:
d2 = {'country' : ['Korea', 'England', 'France'], 
     'population' : [.66, 0.66, 0.66]
    }
df2 = pd.DataFrame(d2)
new_df = pd.concat([df, df2], ignore_index=True)
new_df

   country  population
0  America       14.22
1    China        3.18
2    Japan        1.29
3   Russia        1.40
4    Korea        0.66
5  England        0.66
6   France        0.66

In [15]:
# df['land size'] = pd.Series([960, 937, 37])  to add a column to the data frame df -> Panda function
# df = df.assign(GDP=[14, 21, 5]) to add a column to the data frame df -> DataFrame function

In [16]:
# df.drop([0,1]) (delete row 1 and row 2)

In [17]:
# df.drop(columns='country') (delete column)

In [18]:
# df.['sepalLength'].mean() (get the mean value)

# df.corr(numeric_only=true)  (correlation)

In [20]:
import pandas as pd
df = pd.read_csv('./Datasets/titanic/train.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
df.fillna(value={'Age': df['Age'].median()}, inplace=True)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [25]:
df.fillna(value = {'Embarked' : df['Embarked'].value_counts().idxmax()}, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [27]:
import pandas as pd
df = pd.read_csv('./Datasets/titanic/train.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [28]:
df.groupby('Sex').agg({'Survived': sum})

        Survived
Sex
female       233
male         109

In [29]:
df.groupby('Survived').agg({'Age':'mean'})

                Age
Survived
0         30.626179
1         28.343690